In [5]:

# https://docs.kedro.org/projects/kedro-datasets/en/kedro-datasets-3.0.1/api/kedro_datasets.pandas.CSVDataset.html
from kedro_datasets.pandas import CSVDataset
class AbstractDataset:
    def save():
        ...

    def load():
        ...

In [6]:
config = {"companies":
    {"filepath": "data/01_raw/companies.csv"}
    }

In [7]:
csv_dataset = CSVDataset(**config["companies"])
data = csv_dataset.load()

In [8]:
data.head()

,id,company_rating,company_location,total_fleet_count,iata_approved,company_loaction
0,3888,100%,Isle of Man,1.0,f,na
1,46728,100%,US,1.0,f,UK
2,34618,38%,Isle of Man,1.0,f,UK
3,28619,100%,Bosnia and Herzegovina,1.0,f,na
4,8240,NaN,Chile,1.0,t,na

In [9]:
data.loc[1, "company_location"] = "US"

In [11]:
csv_dataset.save(data)

In [12]:
# To check it's actually saved
csv_dataset.load().head()

,id,company_rating,company_location,total_fleet_count,iata_approved,company_loaction
0,3888,100%,Isle of Man,1.0,f,na
1,46728,100%,US,1.0,f,UK
2,34618,38%,Isle of Man,1.0,f,UK
3,28619,100%,Bosnia and Herzegovina,1.0,f,na
4,8240,NaN,Chile,1.0,t,na